Tools/SnapInstallerUI/Snap.Core.Test/res/TestInstance/Standard/Applications/mdc/ElectronicInvoicing_BR/Files/Templates/Auditor/templates/TemplateExportacao/vm50a/DPEC/pedido_consultadpecnfe.soap

<?xml version="1.0"?><soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap12:Header><sceCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/SCEConsultaRFB"><versaoDados>1.01</versaoDados></sceCabecMsg></soap12:Header><soap12:Body><sceDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/SCEConsultaRFB">%s</sceDadosMsg></soap12:Body></soap12:Envelope>